/**************************************************************************************************************

**************************************************************************************************************/
#define IRCH  0 // 2 ~ 4 MHz内部时钟
#define IRCL  1 // 131 Khz内部时钟
#define PLL   2 //
#define XOSCH 3
#define XOSCL 4

/**************************************************************************************************************/
#define SYSCLK_SRC PLL //芯片系统时钟选择,一般情况设置为IRCH或PLL
/**************************************************************************************************************/

/************系统时钟频率定义，主要用于配置UART波特率**********************************************************/
#if (SYSCLK_SRC == IRCH)
#define FOSC (3686400)
#elif (SYSCLK_SRC == PLL)
#define PLL_Multiple                                                           \
    6 // 定义PLL倍频倍数,当IRCH的频率为3.6864M时，最高倍频数不要超过6倍
#define FOSC (3686400 * PLL_Multiple)
#else
#define FOSC (3686400)
#endif
/***************************************************************************************************************/

#define RTC_CLK_SELECT                                                         \
    IRCL //定义RTC时钟源， 在外接32768晶振时定义为XOSCL，否则定义为IRCL

/***************************************************************************************************************/
#define CHIP_FLASH_SIZE 32 // 定义芯片flash大小，单位为K


#define LVD_RST_ENABLE

#include "user_typedef.h"
